Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_maternity_leave_and_returning_to_work.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Maternity leave and returning to work
ga: Cás-Staidéar ar shaoire mháithreachais agus filleadh ar an obair

source: Sheila took her maternity leave but forgot to let her employer know her intention to return to work
ga: Thóg Sheila saoire mháithreachais ach rinne sí dearmad cur in iúl dá fostóir go raibh sé ar intinn aici filleadh ar an obair

source: She thought her employer knew she was returning since she called into work about 2 months before and was sure she told them she would be coming back
ga: Cheap sí go raibh a fostóir ar an eolas go raibh sí ag filleadh ar ais toisc gur ghlaoigh sí isteach chun na hoibre 2 mhí roimhe sin agus bhí sí cinnte go ndúirt sí leo go raibh sí ag filleadh ar ais

source: When she did return however, her employer told her that she had been replaced and refused to take her back
ga: Nuair a d'fhill sí cibé ar bith, dúirt a fostóir léi go raibh duine eile curtha ina hionad agus diúltaíodh í a thógáil ar ais

source: The employer said the proper written notice of the intention to return had not been given in writing
ga: Dúirt an fostóir nár tugadh fógra scríofa ceart go raibh sé ar intinn aici filleadh ar an obair

source: Sheila was very upset but what are her rights?
ga: Bhí Sheila trína chéile ar fad ach céard iad a cearta?

source: She is required by law to give at least 4 weeks' written notice of her intention to return to work
ga: Tá dualgas uirthi de réir dlí fógra scríofa 4 seachtainí ar a laghad a thabhairt ag cur in iúl gur mian léi filleadh ar an obair

source: She failed to do this and so is in real danger of losing her right to return
ga: Theip uirthi an méid seo a dhéanamh agus dá bhrí tá sí i ngéar-dainséar a ceart filleadh ar an obair a chailliúint

source: The law allows the adjudicator of the Workplace Relations Commission to extend the time for giving notice if there are reasonable grounds for the failure to give notice in the proper manner
ga: Ceadaíonn an dlí breithneoir an Choimisiúin um Chaidreamh san Áit Oibre an tréimhse ama chun fógra a thabhairt a leathnú má tá cúiseanna réasúnta gur teipeadh an fógra a thabhairt ar an mbealach ceart

source: What constitutes reasonable grounds depends on the facts of each case
ga: Tá an méid a chuimsíonn “cúiseanna réasúnta” ag brath ar na fíricí i ngach cás

source: Notice may not have been given for example, because the baby had been very ill
ga: B'fhéidir nár tugadh fógra mar shampla, toisc go raibh an leanbh an-bhreoite

source: It appears Sheila either forgot to give the notice or decided it was unnecessary after she had spoken to her employer
ga: Is cosúil go ndearna Sheila dearmad an fógra a thabhairt nó gur chinn sí nach raibh riachtanas leis tar éis caint lena fostóir

source: It would be a matter for the adjudicator of the Workplace Relations Commission to decide if, in all the circumstances, either of these reasons could be considered reasonable grounds for her failure to give the required written notice
ga: Bheadh sé faoin mbreithneoir an Choimisiúin um Chaidreamh san Áit Oibre an cinneadh a dhéanamh, sna cúinsí ar fad, an féidir ceachtar de na cúiseanna seo a áireamh mar chúiseanna réasúnta gur theip uirthi an fógra scríofa riachtanach a thabhairt

source: If it was decided that there were no reasonable grounds for the failure to give notice, then this would be taken into account in any decision on the case
ga: Má bhí cinneadh déanta nach raibh aon chúiseanna réasúnta gur teipeadh fógra a thabhairt, thógfaí é seo san áireamh mar sin i gcinneadh ar bith maidir leis an gcás

source: This could mean that Sheila would lose her right to return to work and might only get reduced compensation
ga: Chiallódh sé seo go gcaillfeadh Sheila a ceart filleadh ar an obair agus b'fhéidir nach bhfaighfí ach cúiteamh laghdaithe

source: The best policy for an employee is always to follow the notice requirements strictly
ga: An polasaí is fearr d'fhostaí i gcónaí ná na riachtanais maidir le fógra a leanúint go géar i gcónaí
